Sirokujira/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/RX62N/DeviceCode/RX62N_USB/RX62N_usb_functions.cpp
////////////////////////////////////////////////////////////////////////////
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//    http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//  Copyright (c) Microsoft Corporation.  All rights reserved.
//  Copyright (C) 2010 Renesas Electronics Corporation. All rights reserved.
//  Portions Copyright (c) Kentaro Sekimoto All rights reserved.
//
////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////
// Based on RENESAS usb_hal.cpp
////////////////////////////////////////////////////////////////////////////

#include <tinyhal.h>
#include <Include\USB_decl.h>
#include <pal\com\usb\USB.h>
#include "..\RX62N.h"
#include "RX62N_usb_functions.h"
#include "debug_printf.h"

//#define USB_DUMP_SEND
//#define USB_DUMP_RECEIVE
//#define USB_DUMP_BEMP
//#define USB_DUMP_NRDY
//#define USB_DUMP_PID
//#define USB_USE_NRDY_INT
//#define USB_USE_TXZERO_INT

//*********************************************************************************
// NETMF default endpoint
// EP0  Control
// EP1  Bulk In
// EP2  Bulk Out
//*********************************************************************************
// CQ_FRK_RX62N Board information
//*********************************************************************************
// VBUS         P16
// USB_DM       47pin
// USB_DP       48pin
// USB0_DPRPD   32pin (P25) - DP
// USB0_DPUPE-B 43pin (P14)
// USB0_DRPD    (P22) - DM
//*********************************************************************************
//*********************************************************************************
// Defines
//*********************************************************************************

#define USB_MAX_PIPE    10  // max number of pipes
#define USB_MAX_FIFO    3   // max number of fifo
#define FIFO_CFIFO      0   // CFIFO
#define FIFO_D0FIFO     1   // DOFIFO
#define FIFO_D1FIFO     2   // D1FIFO

#define MBW_BYTE        0   // byte access
#define MBW_WORD        1   // word access

#define PIPE_BULK_ST    1   // pipe bulk start no
#define PIPE_INT_ST     6   // pipe interrupt startr no

#define PID_NAK     0
#define PID_BUF     1
#define PID_STALL_1 2
#define PID_STALL_2 3

#define DIR_IN      1       // Write
#define DIR_OUT     0       // Read

#define	MASK_BEMPE	(0x0400)
#define	MASK_NRDYE	(0x0200)
#define	MASK_BRDYE	(0x0100)

//*********************************************************************************
// Type Definitions
//*********************************************************************************
typedef union {
    unsigned short WORD;
    struct {
        unsigned short PID:2;
        unsigned short :3;
        unsigned short PBUSY:1;
        unsigned short SQMON:1;
        unsigned short SQSET:1;
        unsigned short SQCLR:1;
        unsigned short ACLRM:1;
        unsigned short ATREPM:1;
        unsigned short :3;
        unsigned short INBUFM:1;
        unsigned short BSTS:1;
    } BIT;
} PIPECTR;

//*********************************************************************************
// Variables
//*********************************************************************************

USB_CONTROLLER_STATE g_RX62N_USB_ControllerState;
Hal_Queue_KnownSize<USB_PACKET64,USB_QUEUE_PACKET_COUNT> QueueBuffers[USB_MAX_EP - 1];
static UINT8 USB_EP0Buffer[MAX_EP0_SIZE];
static UINT16 USB_EPStatus[USB_MAX_EP];
static const USB_ENDPOINT_DESCRIPTOR *USB_EPDesc[USB_MAX_EP];
static BOOL USB_PinsProtected = FALSE;
static UINT16 USB_EP_Type = 0;
static INT8 RX62N_USB_Pipe[USB_MAX_EP];
static INT8 RX62N_USB_Zero = 0;
static INT8 RX62N_USB_FifoType[USB_MAX_PIPE];
static volatile PIPECTR *pPIPECTR[USB_MAX_PIPE] = {
    (volatile PIPECTR *)&USB0.DCPCTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE1CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE2CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE3CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE4CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE5CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE6CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE7CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE8CTR.WORD,
    (volatile PIPECTR *)&USB0.PIPE9CTR.WORD
};

static volatile UINT16 *pFIFOSEL[USB_MAX_FIFO] =
{
    (volatile UINT16 *)&USB0.CFIFOSEL.WORD,
    (volatile UINT16 *)&USB0.D0FIFOSEL.WORD,
    (volatile UINT16 *)&USB0.D1FIFOSEL.WORD
};

static volatile UINT16 *pFIFOCTR[USB_MAX_FIFO] =
{
    (volatile UINT16 *)&USB0.CFIFOCTR.WORD,
    (volatile UINT16 *)&USB0.D0FIFOCTR.WORD,
    (volatile UINT16 *)&USB0.D1FIFOCTR.WORD
};

#if 1
static volatile UINT8 *pFIFO[USB_MAX_FIFO] =
{
    (volatile UINT8 *)&USB0.CFIFO.BYTE.L,
    (volatile UINT8 *)&USB0.D0FIFO.BYTE.L,
    (volatile UINT8 *)&USB0.D1FIFO.BYTE.L
};
#else
static volatile UINT16 *pFIFO[USB_MAX_FIFO] =
{
    (volatile UINT16 *)&USB0.CFIFO.WORD,
    (volatile UINT16 *)&USB0.D0FIFO.WORD,
    (volatile UINT16 *)&USB0.D1FIFO.WORD
};
#endif
static UINT32 pipe_bulk = PIPE_BULK_ST;
static UINT32 pipe_interrupt = PIPE_INT_ST;

static void wait(volatile UINT32 count)
{
    while (count-- > 0);
}

void usb_int_brdy_enable(UINT16 pipe)
{
	UINT16 tmp;
	tmp = USB0.INTENB0.WORD;
	USB0.INTENB0.WORD = (UINT16)(tmp & (UINT16)~(MASK_BEMPE|MASK_NRDYE|MASK_BRDYE));
	USB0.BRDYENB.WORD |= (1 << pipe);
	USB0.INTENB0.WORD = tmp;
}

void usb_int_brdy_disable(UINT16 pipe)
{
	UINT16  tmp;
	tmp = USB0.INTENB0.WORD;
	USB0.INTENB0.WORD = (UINT16)(tmp & (UINT16)~(MASK_BEMPE|MASK_NRDYE|MASK_BRDYE));
	USB0.BRDYENB.WORD &= ~(1 << pipe);
	USB0.INTENB0.WORD = tmp;
}

void usb_int_nrdy_enable(UINT16 pipe)
{
	UINT16  tmp;
	tmp = USB0.INTENB0.WORD;
	USB0.INTENB0.WORD = (UINT16)(tmp & (UINT16)~(MASK_BEMPE|MASK_NRDYE|MASK_BRDYE));
	USB0.NRDYENB.WORD |= (1 << pipe);
	USB0.INTENB0.WORD = tmp;
}

void usb_int_nrdy_disable(UINT16 pipe)
{
	UINT16 tmp;
	tmp = USB0.INTENB0.WORD;
	USB0.INTENB0.WORD = (UINT16)(tmp & (UINT16)~(MASK_BEMPE|MASK_NRDYE|MASK_BRDYE));
	USB0.NRDYENB.WORD &= ~(1 << pipe);
	USB0.INTENB0.WORD = tmp;
}

