Sirokujira/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/RX62N/DeviceCode/RX62N_USB/RX62N_usb_functions.cpp
void usb_int_bemp_enable(UINT16 pipe)
{
	UINT16 tmp;
	tmp = USB0.INTENB0.WORD;
	USB0.INTENB0.WORD = (UINT16)(tmp & (UINT16)~(MASK_BEMPE|MASK_NRDYE|MASK_BRDYE));
	USB0.BEMPENB.WORD |= (1 << pipe);
	USB0.INTENB0.WORD = tmp;
}

void usb_int_bemp_disable(UINT16 pipe)
{
	UINT16 tmp;
	tmp = USB0.INTENB0.WORD;
	USB0.INTENB0.WORD = (UINT16)(tmp & (UINT16)~(MASK_BEMPE|MASK_NRDYE|MASK_BRDYE));
	USB0.BEMPENB.WORD &= ~(1 << pipe);
	USB0.INTENB0.WORD = tmp;
}

static void RX62N_USB_Pipe_Initialize(void)
{
    UINT32 i;
    for (i = 0; i < USB_MAX_PIPE; i++) {
        RX62N_USB_FifoType[i] = -1;
    }
    RX62N_USB_FifoType[0] = FIFO_CFIFO;
    RX62N_USB_FifoType[1] = FIFO_D1FIFO;
    RX62N_USB_FifoType[2] = FIFO_CFIFO;
    RX62N_USB_FifoType[3] = FIFO_CFIFO;
    RX62N_USB_FifoType[4] = FIFO_CFIFO;
    RX62N_USB_FifoType[5] = FIFO_CFIFO;
    USB0.CFIFOSEL.WORD = 0;
    USB0.D0FIFOSEL.WORD = 0;
    USB0.D1FIFOSEL.WORD = 0;
}

volatile PIPECTR *GetPipeCtr(UINT32 pipe)
{
    volatile PIPECTR *pipectr;
    pipectr = (volatile PIPECTR *)&USB0.PIPE1CTR.WORD;
    pipectr += (pipe - 1);
    return pipectr;
}

UINT16 GetPipePid(UINT32 pipe)
{
    volatile PIPECTR *pipectr = GetPipeCtr(pipe);
    return (pipectr->WORD & 0x000f);
}

UINT16 Pipe_Inbuf(UINT16 pipe)
{
    UINT16 inbuf;
    switch(pipe) {
    case 0:
        inbuf = 0;
        break;
    case 1:
        inbuf = USB0.PIPE1CTR.BIT.INBUFM;
        break;
    case 2:
        inbuf = USB0.PIPE2CTR.BIT.INBUFM;
        break;
    case 3:
        inbuf = USB0.PIPE3CTR.BIT.INBUFM;
        break;
    case 4:
        inbuf = USB0.PIPE4CTR.BIT.INBUFM;
        break;
    case 5:
        inbuf = USB0.PIPE5CTR.BIT.INBUFM;
        break;
    case 6:
        inbuf = 0;
        break;
    case 7:
        inbuf = 0;
        break;
    case 8:
        inbuf = 0;
        break;
    case 9:
        inbuf = 0;
        break;
    default:
        inbuf = 0;
        break;
    }
    return inbuf;
}

void  Pipe_ClearCounter(UINT16 pipe)
{
    switch  (pipe) {
    case 1:
        USB0.PIPE1TRE.BIT.TRENB = 0;
        USB0.PIPE1TRE.BIT.TRCLR = 1;
        break;
    case 2:
        USB0.PIPE2TRE.BIT.TRENB = 0;
        USB0.PIPE2TRE.BIT.TRCLR = 1;
        break;
    case 3:
        USB0.PIPE3TRE.BIT.TRENB = 0;
        USB0.PIPE3TRE.BIT.TRCLR = 1;
        break;
    case 4:
        USB0.PIPE4TRE.BIT.TRENB = 0;
        USB0.PIPE4TRE.BIT.TRCLR = 1;
        break;
    case 5:
        USB0.PIPE5TRE.BIT.TRENB = 0;
        USB0.PIPE5TRE.BIT.TRCLR = 1;
        break;
    default:
        break;
    }
}

#ifdef USB_DUMP_PID
void dump_pid(UINT32 pipe)
{
    volatile PIPECTR *pipectr = GetPipeCtr(pipe);
    UINT16 pid = (pipectr->WORD & 0x000f);
    USB_DEBUG3("P%d:%d\r\n", pipe, pid);
}
#endif

void SetPipePidNAK(UINT32 pipe)
{
    //PIPECTR *pipectr = GetPipeCtr(pipe);
    volatile PIPECTR *pipectr = pPIPECTR[pipe];
    UINT16 cpid = (pipectr->WORD & 0x000f);
    if (cpid == PID_STALL_2) {
        pipectr->BIT.PID = PID_STALL_1;
    }
    pipectr->BIT.PID = PID_NAK;
    if (cpid == PID_BUF) {
        while (pipectr->BIT.PBUSY == 1);
    }
}

void SetPipePidBUF(UINT32 pipe)
{
    //PIPECTR *pipectr = GetPipeCtr(pipe);
    volatile PIPECTR *pipectr = pPIPECTR[pipe];
    pipectr->BIT.PID = PID_BUF;
}

void ClearPipeFIFO(UINT32 pipe)
{
    if (USB0.CFIFOSEL.BIT.CURPIPE == pipe)
        USB0.CFIFOSEL.BIT.CURPIPE = 0;
    if (USB0.D0FIFOSEL.BIT.CURPIPE == pipe)
        USB0.D0FIFOSEL.BIT.CURPIPE = 0;
    if (USB0.D1FIFOSEL.BIT.CURPIPE == pipe)
        USB0.D1FIFOSEL.BIT.CURPIPE = 0;
}

#define FIFO_LOOP       4
#define FIFO_TIMEOUT    2000

void PipeSetFIFO(UINT16 pipe, UINT16 dir, UINT16 mbw)
{
    volatile UINT16 tmp;
    UINT8 type;
    if (pipe >= 0) {
        ClearPipeFIFO(pipe);
        type = RX62N_USB_FifoType[pipe];
        volatile UINT16 *pfifosel = pFIFOSEL[type];
        volatile UINT16 *pfifoctr = pFIFOCTR[type];
        for (UINT32 i = 0; i < FIFO_LOOP; i++) {
            tmp = *pfifosel;
            if (type == FIFO_CFIFO) {
                tmp &= 0xFBD0;
                tmp |= ((mbw << 10) | (dir << 5) | pipe);
            } else {
                tmp &= 0xFBF0;
                tmp |= ((mbw << 10) | pipe);
            }
            *pfifosel = tmp;
            wait(FIFO_TIMEOUT);
            volatile UINT16 j = FIFO_TIMEOUT;
            while (j-- > 0) {
                if (*pfifosel == tmp)
                    break;
            }
            j = FIFO_TIMEOUT;
            while (j-- > 0) {  // FRDY
                if ((*pfifoctr & 0x2000) != 0)
                    return;
            }
        }
        lcd_printf("PipeSetFIFO err %d\r\n", pipe);
    }
}

void RX62N_USB_Interrupt_Enable(void)
{
    ICU.IER[0x04].BIT.IEN6 = 1;     // USBI0
    ICU.IPR[0x0e].BIT.IPR = 0x0e;   // USBI0 Priority
}

void RX62N_USB_Pullup_Connect(void)
{
    USB0.SYSCFG.BIT.DPRPU = 1;
}

void RX62N_USB_Pullup_Disconnect(void)
{
    USB0.SYSCFG.BIT.DPRPU = 0;
}

void RX62N_USB0_Initialize(void)
{
    MSTP(USB0) = 0;
    PORT1.DDR.BIT.B4 = 1;
    PORT1.ICR.BIT.B6 = 1;
    IOPORT.PFKUSB.BYTE = 0x14;
}

void RX62N_USB_Interrupt_Initialize(void)
{
    //USB0.SOFCFG.WORD = 0x20;
    USB0.INTENB0.BIT.VBSE = 1;          // b15
    USB0.INTENB0.BIT.DVSE = 1;          // b12
    USB0.INTENB0.BIT.CTRE = 1;          // b11
    USB0.INTENB0.BIT.BEMPE = 1;         // b10
    USB0.INTENB0.BIT.NRDYE = 1;         // b9
    USB0.INTENB0.BIT.BRDYE = 1;         // b8

    USB0.BEMPENB.BIT.PIPE0BEMPE = 1;    // pipe 0 bemp interrupt enable
    USB0.BRDYENB.BIT.PIPE0BRDYE = 0;    // pipe 0 brdy inerrrupt disable
}

void RX62N_USB_Interrupt_Uninitialize(void)
{
    //USB0.SOFCFG.WORD = 0x20;
    USB0.INTENB0.BIT.VBSE = 0;          // b15
    USB0.INTENB0.BIT.DVSE = 0;          // b12
    USB0.INTENB0.BIT.CTRE = 0;          // b11
    USB0.INTENB0.BIT.BEMPE = 0;         // b10
    USB0.INTENB0.BIT.NRDYE = 0;         // b9
    USB0.INTENB0.BIT.BRDYE = 0;         // b8
}

void RX62N_USB_HW_Initialize(void)
{
    RX62N_USB0_Initialize();
    USB0.SYSCFG.BIT.SCKE = 1;
    USB0.SYSCFG.BIT.USBE = 1;
    USB0.SYSCFG.BIT.DCFM = 0;
    USB0.SYSCFG.BIT.DPRPU = 1;
    RX62N_USB_Pipe_Initialize();
    RX62N_USB_Interrupt_Initialize();
    RX62N_USB_Interrupt_Enable();
}

void RX62N_USB_EP_Initialize(UINT32 pipe, UINT32 ep, UINT32 dir, UINT32 attr, UINT32 size)
{
    ClearPipeFIFO(pipe);
    volatile PIPECTR *pipectr = GetPipeCtr(pipe);
    USB0.PIPESEL.BIT.PIPESEL = pipe;
    SetPipePidNAK(pipe);
    USB0.PIPECFG.WORD = 0;
    USB0.PIPECFG.BIT.EPNUM = ep;        // Endpoint
    USB0.PIPECFG.BIT.DIR = dir;         // Direction
    USB0.PIPECFG.BIT.DBLB = 1;          // Double Buffer
    USB0.PIPECFG.BIT.BFRE = 0;          // Interrupt
    //USB0.PIPECFG.BIT.SHTNAK = 1;
    if (attr == USB_ENDPOINT_ATTRIBUTE_BULK) {
        USB0.PIPECFG.BIT.TYPE = 1;      // BULK
        if (dir == 0) { // OUT
            //pipectr->BIT.ATREPM = 1;
            pipectr->BIT.SQCLR = 1;
            pipectr->BIT.ACLRM = 1;     // Clear Buffer
            pipectr->BIT.ACLRM = 0;     // Clear Buffer
            pipectr->BIT.PID = PID_BUF;
            //PipeSetFIFO((UINT16)pipe, dir, MBW_BYTE);
            usb_int_bemp_disable(pipe);
            usb_int_brdy_disable(pipe);
            //usb_int_brdy_enable(pipe);
        } else {        // IN
            //pipectr->BIT.ATREPM = 1;
            pipectr->BIT.SQCLR = 1;
            pipectr->BIT.ACLRM = 1;     // Clear Buffer
            pipectr->BIT.ACLRM = 0;     // Clear Buffer
            //PipeSetFIFO((UINT16) pipe, dir, MBW_BYTE);
            usb_int_bemp_disable(pipe);
            usb_int_brdy_disable(pipe);
        }
        USB0.PIPEMAXP.BIT.MXPS = size;  // Packet Size
    } else if (attr == USB_ENDPOINT_ATTRIBUTE_INTERRUPT) {
        USB0.PIPECFG.BIT.TYPE = 2;      // Transfer Type
        USB0.PIPEMAXP.BIT.MXPS = size;  // Packet Size
        //usb_int_bemp_disable(pipe);
        //usb_int_brdy_disable(pipe);
    } else if (attr == USB_ENDPOINT_ATTRIBUTE_ISOCHRONOUS) {
        USB0.PIPECFG.BIT.TYPE = 3;      // Transfer Type
        USB0.PIPEMAXP.BIT.MXPS = size;  // Packet Size
        //usb_int_bemp_disable(pipe);
        //usb_int_brdy_disable(pipe);
    }
    USB0.PIPESEL.BIT.PIPESEL = 0;       // Unselect Pipe
}

void USB_Control_Status(void)
{
    USB0.DCPCTR.BIT.PID = PID_BUF;
    USB0.DCPCTR.BIT.CCPL = 1;
}

