Sirokujira/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/RX62N/DeviceCode/RX62N_USB/RX62N_usb_functions.cpp
#if 0
void USB_Stall(INT32 pipe)
{
    if (pipe == 0) {
        if (USB0.DCPCTR.BIT.PID == PID_NAK) {
            USB0.DCPCTR.BIT.PID = PID_STALL_1;
        } else if(USB0.DCPCTR.BIT.PID == PID_BUF) {
            USB0.DCPCTR.BIT.PID = PID_STALL_2;
        }
    } else {
        volatile PIPECTR *pipectr = GetPipeCtr(pipe);
        if (pipectr->BIT.PID == PID_BUF) {
            pipectr->BIT.PID = PID_STALL_2;
        } else {
            pipectr->BIT.PID = PID_STALL_1;
        }
    }
}
#endif

void USB_Stall_Clear(INT32 pipe)
{
    volatile PIPECTR *pipectr = GetPipeCtr(pipe);
    pipectr->BIT.PID = PID_NAK;
    while (pipectr->BIT.PBUSY == 1){;}
    pipectr->BIT.SQCLR = 1;
    pipectr->BIT.ACLRM = 1;
    pipectr->BIT.ACLRM = 0;
    USB0.PIPESEL.BIT.PIPESEL = pipe;
    if (USB0.PIPECFG.BIT.DIR == 0) {
        // receive direction
        pipectr->BIT.PID = PID_BUF;
    }
}

#if 0
BOOL USB_Is_Stalled(INT32 pipe)
{
    volatile PIPECTR *pipectr = GetPipeCtr(pipe);
    if ((pipectr->BIT.PID == PID_STALL_1) ||
        (pipectr->BIT.PID == PID_STALL_2)) {
        return true;
    } else {
        return false;
    }
}
#endif

void Pipe_Config(void)
{
    USB_CONTROLLER_STATE *State = &g_RX62N_USB_ControllerState;
    const USB_ENDPOINT_DESCRIPTOR *pep = (USB_ENDPOINT_DESCRIPTOR *)NULL;
    const USB_INTERFACE_DESCRIPTOR *pif  = (USB_INTERFACE_DESCRIPTOR *)NULL;
    while (USB_NextEndpoint(State, pep, pif)) {
        UINT32 endpoint = pep->bEndpointAddress & 0x7F;
        UINT32 dir = (pep->bEndpointAddress & 0x80)? 1:0;
        RX62N_USB_EP_Initialize((UINT32)RX62N_USB_Pipe[endpoint],
                (UINT32)endpoint, (UINT32)dir, pep->bmAttributes, pep->wMaxPacketSize);
    }
}

void RX62N_USB_EP_Reset(void)
{
    USB_DEBUG1("Ep\r\n");
    UINT32 i;
    INT32 pipeno;
    for (i = 0; i < USB_MAX_EP; i++) {
        pipeno = RX62N_USB_Pipe[i];
        if (pipeno >= 0)
            USB_Stall_Clear((UINT32)pipeno);
    }
}

void RX62N_USB_Reset(void)
{
    USB_DEBUG1("Rt\r\n");
    UINT32 i;
    INT32 pipeno;
    Pipe_Config();
    RX62N_USB_EP_Reset();
    RX62N_USB_Interrupt_Initialize();
}

void Pipe_Read(UINT32 pipe, volatile UINT8 *buf, UINT32 size, volatile UINT32 *count)
{
    UINT8 dummy;
    UINT32 len;
    UINT8 type = RX62N_USB_FifoType[pipe];
    GLOBAL_LOCK(irq);
    PipeSetFIFO((UINT16)pipe, DIR_OUT, MBW_BYTE);
    volatile UINT16 *pfifosel = (volatile UINT16 *)pFIFOSEL[type];
    volatile UINT16 *pfifoctr = (volatile UINT16 *)pFIFOCTR[type];
    volatile UINT8 *pfifo = (volatile UINT8 *)pFIFO[type];
    *pfifosel |= 0x8000;                // RCNT = 1
    len = *pfifoctr & 0x01FF;           // DTLN
    if (len == 0) {
        *pfifoctr |= 0x4000;            // BCLR = 1
    }
    if (buf != NULL) {
        while ((len!= 0) && (size > *count)) {
            *buf++ = *pfifo;
            (*count)++;
            len--;
        }
    }
    SetPipePidNAK(pipe);
    if ((*count == 0) && (0 != (*pfifoctr & 0x01FF))) {
        lcd_printf("fr error\r\n");
        while (0 != (*pfifoctr & 0x01FF)) {
            dummy = *pfifo;
        }
    }
    USB_DEBUG2("Pr%02d", *count);
}

#ifdef USE_FUNC
void Fifo_Write(UINT8 type, volatile UINT8 *buf, UINT32 size, volatile UINT32 len)
{
    UINT32 count = 0;
    switch (type) {
    case FIFO_CFIFO:
        while ((count < size) && (len != 0)) {
            USB0.CFIFO.BYTE.L = (UINT8)*buf;
            buf++;
            len--;
            count++;
        }
        break;
    case FIFO_D0FIFO:
        while ((count < size) && (len != 0)) {
            USB0.D0FIFO.BYTE.L = (UINT8)*buf;
            buf++;
            len--;
            count++;
        }
        break;
        break;
    case FIFO_D1FIFO:
    default:
        while ((count < size) && (len != 0)) {
            USB0.D1FIFO.BYTE.L = (UINT8)*buf;
            buf++;
            len--;
            count++;
        }
        break;
        break;
    }
}

void Fifo_BVAL(UINT8 type, UINT16 bval)
{
    switch (type) {
    case FIFO_CFIFO:
        USB0.CFIFOCTR.BIT.BVAL = 1;
        break;
    case FIFO_D0FIFO:
        USB0.D0FIFOCTR.BIT.BVAL = 1;
        break;
    case FIFO_D1FIFO:
        USB0.D1FIFOCTR.BIT.BVAL = 1;
    default:
        break;
    }
}
#endif

void Pipe_Write(UINT32 pipe, volatile UINT8 *buf, UINT32 size, volatile UINT32 len)
{
    //USB_DEBUG2("Pw%02d", len);
    GLOBAL_LOCK(irq);
    PipeSetFIFO((UINT16)pipe, DIR_IN, MBW_BYTE);
    UINT32 count = 0;
    UINT8 type = RX62N_USB_FifoType[pipe];
    volatile UINT16 *pfifoctr = (volatile UINT16 *)pFIFOCTR[type];
    volatile UINT8 *pfifo = (volatile UINT8 *)pFIFO[type];
    if (buf != NULL)
#ifdef USE_FUNC
        Fifo_Write(type, buf, size, len);
#else
    if (buf != NULL)
        while ((len != 0) && (size > count)) {
            *pfifo = (UINT8)*buf;
            buf++;
            count++;
            len--;
        }
#endif
#ifdef USE_FUNC
    if (len != size) {
        Fifo_BVAL(type, 1);
    }
#else
    if (count != size) {
        *pfifoctr |= 0x8000;            // BVAL = 1
    }
#endif
    SetPipePidBUF(pipe);
    usb_int_brdy_disable(pipe); // disable interrupt
    usb_int_bemp_enable(pipe);  // enable interrupt
    usb_int_nrdy_enable(pipe);  // enable interrupt
}

void Pipe0_Read(UINT8 *buf, UINT32 size, UINT32 *len)
{
    volatile UINT8 dummy = 0;
    UINT32 count = 0;
    PipeSetFIFO(0, 0, MBW_BYTE);
    USB0.CFIFOSEL.BIT.RCNT = 1;
    while ((size > *len) && (0 != USB0.CFIFOCTR.BIT.DTLN)) {
        if (buf != NULL) {
            *buf = (UINT8)USB0.CFIFO.BYTE.L;
            buf++;
            count++;
        } else {
            dummy = (UINT8)USB0.CFIFO.BYTE.L;
        }
        (*len)++;
    }
    if (((0 != size) && (size == *len)) || (count != size)) {
        USB0.DCPCTR.BIT.PID = PID_BUF;
        USB0.DCPCTR.BIT.CCPL = 1;
    }
    USB_DEBUG2("Cr%d", count);
    if (0 != USB0.CFIFOCTR.BIT.DTLN) {
        lcd_printf("cr error\r\n");
    }
    (void) dummy;
}

void HandleSetupCmd(void)
{
    USB_CONTROLLER_STATE *State = &g_RX62N_USB_ControllerState;
    USB0.INTSTS0.BIT.VALID = 0;
    USB_SETUP_PACKET *st = (USB_SETUP_PACKET *)&USB_EP0Buffer[0];
    st->bmRequestType = (UINT8)(USB0.USBREQ.WORD & 0xff);
    st->bRequest = (UINT8)(USB0.USBREQ.WORD >> 8);
    st->wValue = USB0.USBVAL;
    st->wIndex = USB0.USBINDX;
    st->wLength = USB0.USBLENG;
    USB_DEBUG4("U%02x:%04x:%04x", st->bRequest, st->wValue, st->wLength);
    State->Data = (UINT8 *)&USB_EP0Buffer[0];
    State->DataSize = (UINT8)8;
    UINT8 result = USB_ControlCallback(State);
   // g_Control.m_etState = STATE_CONTROL_SETUP;
    switch (result) {
    case USB_STATE_DATA:
        break;
    case USB_STATE_ADDRESS:
        /* upper layer needs us to change the address */
        // address change delayed to end of reply packet
        break;
    case USB_STATE_DONE:
        USB_DEBUG1("E\n");
        State->DataCallback = NULL;
        break;
    case USB_STATE_STALL:
        USB_DEBUG1("l");
        return;
    case USB_STATE_STATUS:
        USB_DEBUG1("m");
        break;
    case USB_STATE_CONFIGURATION:
        USB_DEBUG1("c");
        break;
    case USB_STATE_REMOTE_WAKEUP:
        USB_DEBUG1("w");
        break;
    default:
        break;
    }
    if (result != USB_STATE_STALL) {
        if (State->DataCallback != NULL) {
            State->DataCallback(State);
            if (State->DataSize != 0) {
                USB_DEBUG1("HSi");
                Pipe_Write(0, (UINT8 *)State->Data, (UINT32)MAX_EP0_SIZE, (UINT32)State->DataSize);
            } else {
                USB_DEBUG1("HS0");
                USB_Control_Status();
            }
        }
    }
}

