Sirokujira/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/RX62N/DeviceCode/RX62N_USB/RX62N_usb_functions.cpp
void HandleVBus(void)
{
    USB_DEBUG1("V");
    UINT8 vbsts_value;
    UINT8 count;
    #define CHATTER_COUNT 5
    do {
        count = CHATTER_COUNT;
        vbsts_value = (UINT8)USB0.INTSTS0.BIT.VBSTS;
        while (count != 0) {
            if ((UINT8)USB0.INTSTS0.BIT.VBSTS != vbsts_value) {
                break;
            } else {
                count--;
            }
        }
    } while (count != 0);
    if (1 == vbsts_value) { // connected;
        RX62N_USB_Reset();
    } else {                // disconnected;
        RX62N_USB_Reset();
    }
}

void HandleDVST(void)
{
    switch(USB0.INTSTS0.BIT.DVSQ)
    {
        case 0:         // Powered State
            USB_DEBUG1("D0\r\n");
            break;
        case 1:         // Default State
            USB_DEBUG1("D1\r\n");
            if (USB0.DVSTCTR0.BIT.RHST == 4) {  // BUS RESET
                RX62N_USB_EP_Reset();
            }
            break;
        case 2:         // Address State
            USB_DEBUG1("D2\r\n");
            break;
        case 3:         // Configured State
            USB_DEBUG1("D3\r\n");
            RX62N_USB_EP_Reset();
#ifdef USB_DUMP_PID
            dump_pid(1);
            dump_pid(2);
#endif
            break;
        case 4:
        default:        // Suspended State
            USB_DEBUG1("D4\r\n");
            break;
    };
}

void HandleCTRT(void)
{
    switch(USB0.INTSTS0.BIT.CTSQ)
    {
        case 0:         // IDLE or Setup
            USB_DEBUG1("C0\r\n");
            break;
        case 1:         // Control Read Data
            USB_DEBUG1("C1");
            HandleSetupCmd();
            break;
        case 2:         // Control Read Status
            USB_DEBUG1("C2");
            break;
        case 3:         // Control Write Data
            USB_DEBUG1("C3");
            HandleSetupCmd();
            break;
        case 4:         // Control Write Status
            USB_DEBUG1("C4");
            break;
        case 5:         // Control Write(no data) Status
            USB_DEBUG1("C5");
            HandleSetupCmd();
        break;
        case 6:         // Control Transfer Error
            USB_DEBUG1("C6");
        break;
        default:        // INVALID
            USB_DEBUG1("C7");
        break;
    };
}

void RX62N_USB_Send(USB_CONTROLLER_STATE *State, UINT32 endpoint)
{
    GLOBAL_LOCK(irq);
    USB_PACKET64* Packet64 = USB_TxDequeue(State, endpoint, TRUE);
    UINT32 pipeno = RX62N_USB_Pipe[endpoint];
    const USB_ENDPOINT_DESCRIPTOR *pep = USB_EPDesc[endpoint];
    if (Packet64) {
        Pipe_Write(pipeno, (UINT8 *)Packet64->Buffer, pep->wMaxPacketSize, (UINT32)Packet64->Size);
#ifdef USB_DUMP_SEND
        USB_DEBUG2("brw%d\r\n", Packet64->Size);
        usb_memory_dump((unsigned long)Packet64->Buffer, Packet64->Size);
#endif
#ifdef USB_USE_TXZERO_INT
        if (pep->wMaxPacketSize == Packet64->Size)
            RX62N_USB_Zero = 1;
#endif
    } else {
        USB_DEBUG1("brw0\r\n");
        //RX62N_USB_Zero = 2;
        //Pipe_Write(pipeno, 0, pep->wMaxPacketSize, 0);
    }
}

void RX62N_USB_Receive(USB_CONTROLLER_STATE *State, UINT32 endpoint)
{
    GLOBAL_LOCK(irq);
    BOOL full;
    UINT32 pipeno = RX62N_USB_Pipe[endpoint];
    USB_PACKET64* Packet64 = USB_RxEnqueue(State, endpoint, full);
    if (Packet64) {
        const USB_ENDPOINT_DESCRIPTOR *pep = USB_EPDesc[endpoint];
            UINT32 size = 0;
            Pipe_Read(pipeno, (UINT8 *)Packet64->Buffer, pep->wMaxPacketSize, &size);
            Packet64->Size = (UINT8)size;
#ifdef USB_DUMP_RECEIVE
            USB_DEBUG2("brr%d\r\n", Packet64->Size);
            usb_memory_dump((unsigned long)Packet64->Buffer, Packet64->Size);
#endif
            usb_int_brdy_disable(pipeno);
#if 0
            if (full) {
                USB_DEBUG1("Fu");
                usb_int_brdy_disable(pipeno);
            }
#endif
    } else {
        USB_DEBUG1("brr0\r\n");
        //usb_int_brdy_disable(pipeno);
    }

}

// BEMP Interrupt Handler
// TX: when TX completion
// RX: when receiving data > MaxPackectSize
void HandleBEMP(void)
{
    GLOBAL_LOCK(irq);
    USB_CONTROLLER_STATE *State = &g_RX62N_USB_ControllerState;
    UINT32 bempsts = (UINT32)USB0.BEMPSTS.WORD;
    UINT32 bempenb = (UINT32)USB0.BEMPENB.WORD;
    if (1 == USB0.BEMPSTS.BIT.PIPE0BENP) {
        USB_DEBUG1("Be0");
        USB0.BEMPSTS.WORD = ~0x0001;
        if (State->DataCallback != NULL) {
            State->DataCallback(State);
            if (State->DataSize != 0) {
                Pipe_Write(0, (UINT8 *)State->Data, (UINT32)MAX_EP0_SIZE, (UINT32)State->DataSize);
            } else {
                USB_Control_Status();
            }
        } else {
            USB_Control_Status();
        }
    } else {
        USB0.BEMPSTS.WORD = ~bempsts;
        for (UINT32 endpoint = 1; endpoint < USB_MAX_EP; endpoint++) {
            INT8 pipeno = RX62N_USB_Pipe[endpoint];
            if (pipeno >= 0) {
                UINT32 mask = (1 << pipeno);
                if ((bempsts & mask) && (bempenb & mask)) {
#ifdef USB_DUMP_BEMP
                    USB_DEBUG2("Be%d", endpoint);
#endif
                    UINT16 pid = GetPipePid(pipeno);
                    if ((pid == PID_STALL_1) || (pid == PID_STALL_2)) {
                        USB_DEBUG2("St%d", pid);
                    } else {
                        if (Pipe_Inbuf(pipeno) == 0) {
                            usb_int_bemp_disable(pipeno);
                            SetPipePidNAK(pipeno);
#ifdef USB_USE_TXZERO_INT
                            if (RX62N_USB_Zero == 1) {
                                USB_DEBUG1("s0");
                                Pipe_Write(pipeno, 0, 64, 0);
                                RX62N_USB_Zero = 2;
                            }
#endif
                        }
                    }
                }
            }
        }
    }
}

void HandleNRDY(void)
{
    GLOBAL_LOCK(irq);
    UINT32 nrdysts = (UINT32)USB0.NRDYSTS.WORD;
    UINT32 nrdyenb = (UINT32)USB0.NRDYENB.WORD;
    USB0.NRDYSTS.WORD = ~nrdysts;
    for (UINT32 endpoint = 1; endpoint < USB_MAX_EP; endpoint++) {
        INT8 pipeno = RX62N_USB_Pipe[endpoint];
        if (pipeno >= 0) {
            UINT32 mask = (1 << pipeno);
            if ((nrdysts & mask) && (nrdyenb & mask)) {
                USB0.NRDYSTS.WORD = ~mask;
#ifdef USB_DUMP_NRDY
                USB_DEBUG2("Nr%d", pipeno);
#endif
#ifdef USB_USE_TXZERO_INT
                if (RX62N_USB_Zero == 2) {
                    RX62N_USB_Zero = 0;
                } else {
                    SetPipePidBUF(pipeno);
                }
#endif
                usb_int_nrdy_disable(pipeno);
            }
        }
    }
}

void HandleBRDY(void)
 {
	UINT32 brdysts = (UINT32) USB0.BRDYSTS.WORD;
	UINT32 brdyenb = (UINT32) USB0.BRDYENB.WORD;
	USB_CONTROLLER_STATE *State = &g_RX62N_USB_ControllerState;

	if ((USB0.BRDYSTS.BIT.PIPE0BRDY == 1)
	        && (USB0.BRDYENB.BIT.PIPE0BRDYE == 1)) {
		USB_DEBUG1("br0");
		USB0.BRDYSTS.WORD = ~0x0001;
		State->Data = (UINT8 *) &USB_EP0Buffer[0];
		UINT32 size = 0;
		Pipe0_Read((UINT8 *) State->Data, MAX_EP0_SIZE, &size);
		State->DataSize = (UINT8) size;
	} else {
		for (UINT32 endpoint = 1; endpoint < USB_MAX_EP; endpoint++) {
			INT8 pipeno = RX62N_USB_Pipe[endpoint];
			if (pipeno >= 0) {
			    UINT32 mask = (1 << pipeno);
			    if ((brdysts & mask) && (brdyenb & mask)) {
			        USB0.BRDYSTS.WORD = ~mask;
			        USB0.PIPESEL.BIT.PIPESEL = pipeno;
			        if (USB0.PIPECFG.BIT.DIR == 0) {
			            RX62N_USB_Receive(State, endpoint);  // OUT
			        } else {
			            RX62N_USB_Send(State, endpoint);     // IN
			        }
			    }
			}
		}
	}
 }

static void USBInterruptHandler(void)
{
    if (1 == USB0.INTSTS0.BIT.VBINT) {
        USB0.INTSTS0.BIT.VBINT = 0;
        HandleVBus();
    }
    if (1 == USB0.INTSTS0.BIT.DVST) {
        USB0.INTSTS0.BIT.DVST = 0;
        HandleDVST();
    }
    if (1 == USB0.INTSTS0.BIT.CTRT) {
        HandleCTRT();
        USB0.INTSTS0.BIT.CTRT = 0;
    }
    if (1 == USB0.INTSTS0.BIT.BEMP) {
        HandleBEMP();
    }
    if (1 == USB0.INTSTS0.BIT.NRDY) {
        HandleNRDY();
    }
    if (1 == USB0.INTSTS0.BIT.BRDY) {
        HandleBRDY();
    }
}

USB_CONTROLLER_STATE * CPU_USB_GetState(int Controller)
{
    if (Controller != 0)
        return NULL;
    return (USB_CONTROLLER_STATE *)&g_RX62N_USB_ControllerState;
}

// CPU_USB_Initialize Function
//  Initializes the client module at the driver layer.
HRESULT CPU_USB_Initialize(int Controller)
{
    USB_DEBUG_INIT();
    USB_DEBUG1("CPU_USB_Initialize START\n");
    GLOBAL_LOCK(irq);
    USB_CONTROLLER_STATE *State = &g_RX62N_USB_ControllerState;
    if (Controller != 0) return S_FALSE;
#ifdef RENESAS_FW
    USB_Init();
#endif
    RX62N_USB_HW_Initialize();
    USB_PinsProtected = FALSE;
    CPU_USB_ProtectPins(Controller, TRUE);;
    State->DeviceState = USB_DEVICE_STATE_DETACHED;
    USB_StateCallback(State);
    USB_PinsProtected = TRUE;
    State->EndpointCount = USB_MAX_EP;
    State->EndpointStatus = &USB_EPStatus[0];
    State->PacketSize = MAX_EP0_SIZE;
    UINT32 endpoint;
    for (endpoint = 1; endpoint < USB_MAX_EP; endpoint++) {
        State->CurrentPacketOffset[endpoint] = 0;
        State->IsTxQueue[endpoint] = FALSE;
        State->MaxPacketSize[endpoint] = USB_MAX_DATA_PACKET_SIZE;
        RX62N_USB_Pipe[endpoint] = -1;
    }
    USB_EP_Type = 0;
    RX62N_USB_Zero = 0;
    pipe_interrupt = PIPE_INT_ST;
    pipe_bulk = PIPE_BULK_ST;
    const USB_ENDPOINT_DESCRIPTOR *pep = (USB_ENDPOINT_DESCRIPTOR *)NULL;
    const USB_INTERFACE_DESCRIPTOR *pif  = (USB_INTERFACE_DESCRIPTOR *)NULL;
    while (USB_NextEndpoint(State, pep, pif)) {
        endpoint = pep->bEndpointAddress & 0x7F;
        UINT8 endpointSize = pep->wMaxPacketSize;
        State->MaxPacketSize[endpoint] = endpointSize;
        QueueBuffers[endpoint-1].Initialize();
        State->Queues[endpoint] = &QueueBuffers[endpoint-1];
        USB_EPDesc[endpoint] = pep;
        switch (pep->bmAttributes) {
        case USB_ENDPOINT_ATTRIBUTE_BULK:
            RX62N_USB_Pipe[endpoint] = pipe_bulk;
            if (pep->bEndpointAddress & 0x80) {
                RX62N_USB_EP_Initialize((UINT32)pipe_bulk++,
                        (UINT32)endpoint, (UINT32)1, pep->bmAttributes, endpointSize);
                State->IsTxQueue[endpoint] = TRUE;
            } else {
                RX62N_USB_EP_Initialize((UINT32)pipe_bulk++,
                        (UINT32)endpoint, (UINT32)0, pep->bmAttributes, endpointSize);
            }
            break;
        case USB_ENDPOINT_ATTRIBUTE_INTERRUPT:
            RX62N_USB_Pipe[endpoint] = pipe_interrupt;
            if (pep->bEndpointAddress & 0x80) {
                RX62N_USB_EP_Initialize(pipe_interrupt++,
                        endpoint, 1, pep->bmAttributes, endpointSize);
                State->IsTxQueue[endpoint] = TRUE;
            } else {
                RX62N_USB_EP_Initialize(pipe_interrupt++,
                        endpoint, 0, pep->bmAttributes, endpointSize);
            }
            break;
        case USB_ENDPOINT_ATTRIBUTE_ISOCHRONOUS:
            // ToDo
        default:
            break;
        }
        USB_EP_Type |= (pep->bmAttributes & 3) << (endpoint * 2);
    }
    if (USB_EP_Type == 0)
        return S_FALSE;
    HAL_Time_Sleep_MicroSeconds(1000);
    RX62N_USB_Interrupt_Enable();
    CPU_USB_ProtectPins(Controller, FALSE);
    USB_DEBUG1("*I*");
    return S_OK;
}

// CPU_USB_Uninitialize Function
//  Uninitializes (shuts down) USB communications at the driver layer.
HRESULT CPU_USB_Uninitialize(int Controller)
{
    USB_CONTROLLER_STATE *State = &g_RX62N_USB_ControllerState;
    GLOBAL_LOCK(irq);
    memset(&g_RX62N_USB_ControllerState, 0, sizeof(g_RX62N_USB_ControllerState));
    CPU_USB_ProtectPins(Controller, TRUE);
    USB_EP_Type = 0;
    State->DeviceState = USB_DEVICE_STATE_DETACHED;
    RX62N_USB_Interrupt_Uninitialize();
    USB_DEBUG1("*U*");
    return S_OK;
}

// CPU_USB_StartOutput Function
//  Begins sending output to a specified USB port.
BOOL CPU_USB_StartOutput(USB_CONTROLLER_STATE* State, int endpoint)
{
    //GLOBAL_LOCK(irq);
    USB_DEBUG2("\r\nSo%d ", endpoint);
    if (State == NULL || endpoint >= USB_MAX_EP)
        return FALSE;
    if (State->Queues[endpoint] == NULL || !State->IsTxQueue[endpoint])
        return FALSE;
    if (USB_EPStatus[endpoint] & USB_STATUS_ENDPOINT_HALT) {
        while (USB_TxDequeue(State, endpoint, TRUE) != NULL);  // clear TX queue
        return TRUE;
    }
#if 1
    UINT32 pipeno = RX62N_USB_Pipe[endpoint];
    if (Pipe_Inbuf(pipeno) == 0) {
        SetPipePidNAK(pipeno);
#ifdef USB_DUMP_PID
        dump_pid(pipen0);
#endif
        RX62N_USB_Send(State, endpoint);
#ifdef USB_DUMP_PID
        dump_pid(pipeno);
#endif
#else
        UINT32 pipeno = RX62N_USB_Pipe[endpoint];
        Pipe_ClearCounter(pipeno);
        SetPipePidNAK(pipeno);
        usb_int_brdy_enable(pipeno);
#endif
        return TRUE;
    } else
        return FALSE;
}

// CPU_USB_RxEnable Function
//  Enables a specified USB port to receive data.
BOOL CPU_USB_RxEnable(USB_CONTROLLER_STATE* State, int endpoint)
{
    GLOBAL_LOCK(irq);
    USB_DEBUG2("\r\nRe%d ", endpoint);
    UINT32 pipeno = RX62N_USB_Pipe[endpoint];
    SetPipePidBUF(pipeno);
    usb_int_brdy_enable(pipeno);
    return TRUE;
}

// CPU_USB_GetInterruptState Function
//  Determines whether there are currently interrupts pending for the USB port.
BOOL CPU_USB_GetInterruptState()
{
#if 0
    BOOL flag = ((USB0.BEMPENB.WORD & USB0.BEMPSTS.WORD) != 0) || ((USB0.BRDYENB.WORD & USB0.BRDYSTS.WORD) != 0);
    USB_DEBUG2("Is%d", flag);
    return flag;
#else
    return FALSE;
#endif
}

// Puts USB pins into a known state to prevent spurious inputs.
// Parameters
// On
// A value you can set to true to protect the USB pins; set it to false to disable protection.
// Return Value
// true if the operation succeeded; otherwise, false.
//
// Setting the On parameter to true detaches the USB module from the host.
// This protects the USB pins by stopping all USB communications.
// Setting On to false enables the pins, thus enabling the host to detect the USB client.
// As soon as the USB client is detected, the enumeration process begins.
// USB communications resume when the enumeration process has finished.
BOOL CPU_USB_ProtectPins(int Controller, BOOL On)
{
    USB_CONTROLLER_STATE *State = &g_RX62N_USB_ControllerState;
    GLOBAL_LOCK(irq);
    if (On == TRUE) {
        if (USB_PinsProtected == FALSE) {
            USB_DEBUG1("+");
            USB_PinsProtected = TRUE;
            RX62N_USB_Pullup_Disconnect();
            RX62N_USB_Reset();
            for(int ep = 1; ep < USB_MAX_EP; ep++) {
                if (State->Queues[ep] && State->IsTxQueue[ep]) {
                    while (USB_TxDequeue(State, ep, TRUE) != NULL);
                }
            }
            State->DeviceState = USB_DEVICE_STATE_DETACHED;
            USB_StateCallback(State);
        }
    } else {
        if (USB_PinsProtected == TRUE) {
            USB_DEBUG1("-");
            USB_PinsProtected = FALSE;
            RX62N_USB_Pullup_Connect();
            RX62N_USB_Reset();
            State->DeviceState = USB_DEVICE_STATE_ATTACHED;
            USB_StateCallback(State);
        }
    }
    return TRUE;
}

#ifdef __cplusplus
extern "C" {
#endif
void __attribute__ ((interrupt)) INT_Excep_USB0_D0FIFO0(void) {}
void __attribute__ ((interrupt)) INT_Excep_USB0_D1FIFO0(void) {}
void __attribute__ ((interrupt)) INT_Excep_USB0_USBI0(void)
{
    USBInterruptHandler();
}
#ifdef __cplusplus
}
#endif
